package com.gavynzhang.welcome2016.Data;

/**
 * Created by Administrator on 2016/8/10.
 */
public class BigData {

    public static final String[] collegesName = new String[]{
            "通信与信息工程学院",
            "计算机科学与技术学院",
            "光电工程学院/重庆国际半导体学院",
            "经济管理学院",
            "软件工程学院",
            "自动化学院",
            "先进制造工程学院",
            "传媒艺术学院",
            "生物信息学院",
            "理学院",
            "体育学院",
            "法学院",
            "外国语学院",
            "国际学院",
            "半导体"
    };


    public static final String[][] majorsName = new String[][]{
            {"通信信息类","广电与数字媒体类"},
            {"计算机与智能科学类"},
            {"电子工程类","集成电路工程类"},
            {"工程管理","工商管理类","信息管理与信息系统","电子商务类","经济学"},
            {"软件工程"},
            {"自动化与电气工程类"},
            {"先进制造类"},
            {"广播电视编导","数字媒体艺术与动画类","艺术设计类"},
            {"生物医学工程","生物信息学"},
            {"数理科学与信息技术类"},
            {"社会体育指导与管理"},
            {"法学类"},
            {"英语类"},
            {"电子信息工程（中外合作办学）","软件工程（中外合作办学）"},
            {"无数据"}
    };


    public static final double[][]  majorsSexualRatio = new double[][]{
            {76.00, 59.85},
            {79.79},
            {77.80, 88.74},
            {80.33, 42.16, 62.62, 61.68, 57.53},
            {83.90},
            {82.23},
            {90.94},
            {25.21, 37.28, 30.90},
            {51.65, 66.67},
            {72.31},
            {75.41},
            {33.01},
            {18.29},
            {75.00, 85.00},
            {50.00}
    };


    public static final String[][] difficultCourse = new String[][]{
            {"电子电路","高等数学","大学物理"}, //通信
            {"大学物理","高等数学","线性代数"}, //计算机
            {"大学物理","概率论","工程图学"},  //光电
            {"概率论","高等数学","C语言"},       //经管
            {"高等数学","离散数学","C++"}, //软件
            {"大学物理","高等数学","C语言"}, //自动化
            {"工程图学","大学物理","高等数学"}, //先进
            {"视听说","读写译","美术史"}, //传媒
            {"高等数学","视听说","化学"}, //生物
            {"数学分析","高等数学","大学物理"}, //理学
            {"运动解剖学","体育概论","健美操"}, //体育
            {"刑法","民法","法理"}, //法学
            {"基础英语","英语语音","英语阅读"}, //外国语
            {"无数据","无数据","无数据"}, //国际
            {"软件设计基础","线性代数","大学物理"}  //半导体
    };


    public static final double[][] difficultRatio = new double[][]{
            {62.00, 18.00, 20.00},
            {40.00, 35.00, 25.00},
            {54.00, 26.00, 20.00},
            {42.00, 38.00, 20.00},
            {56.00, 23.00, 21.00},
            {45.00, 30.00, 25.00},
            {55.00, 24.00, 21.00},
            {43.00, 32.00, 25.00},
            {45.00, 31.00, 24.00},
            {49.00, 28.00, 23.00},
            {56.00, 22.00, 22.00},
            {54.90, 24.51, 20.59},
            {44.55, 28.18, 27.27},
            {33.33, 33.33, 33.33},
            {52.00, 32.00, 16.00}
    };


    public static final String[] graduateSituation = new String[]{
            "签约就业",
            "升学出国",
            "待就业",
            "灵活就业"
    };


    public static final double[][] situationRatio = new double[][]{
            {75.60, 22.23, 2.08, 0.09}, //tx
            {73.02, 21.50, 4.67, 0.81}, //jsj
            {71.06, 23.40, 5.53, 0.01}, //gd
            {85.61,	09.30, 5.09, 0.00}, //jg
            {86.97, 07.04, 4.58, 1.41}, //rj
            {71.06, 17.25, 1.04, 0.36}, //zdh
            {85.71, 10.08, 4.20, 0.01}, //xj
            {82.64, 10.60, 2.61, 4.15}, //cm
            {71.64, 23.51, 4.48, 0.37}, //sw
            {77.85, 14.56, 5.06, 2.53}, //lx
            {86.67, 11.67, 1.67, 0.00}, //ty
            {63.75, 31.25, 5.00, 0.00}, //fx
            {84.38, 15.63, 0.00, 0.00}, //wgy
            {25.00, 25.00, 25.00, 25.00}, //gj
            {76.03, 18.49, 5.48, 0.00} //bdt
    };



}
